[   {
        "img": "static/img/telco_dashboard.png",
        "description": "Discover why telecom users leave — this churn analysis project explores customer behavior and business impact with data-driven insights and interactive dashboards.",
        "link": "apps/telco_churn/",
        "title": "Customer Churn Analysis",
        "about": "An end-to-end data science case study analyzing customer churn for a telecom provider using SQL, Python, Tableau, and Web technologies.",
        "tech": ["SQL", "Python", "Pandas", "Scikit-learn", "CatBoost", "Tableau", "HTML/CSS/JS"],
        "features": [
            "Cleaned and transformed CSV data using SQL queries",
            "Performed EDA in Python with Seaborn and Pandas",
            "Trained and evaluated machine learning models (Logistic Regression, Random Forest, CatBoost)",
            "Designed Tableau dashboards with KPIs, filters, and churn segments",
            "Deployed a web interface with Business & Tech views hosted on GitHub Pages"
        ]
    }, 
    {
        "img": "static/img/covid-19_dashboard.png",
        "description": "Explore this interactive Tableau dashboard showcasing COVID-19 trends from 2020 — track cases, recoveries, and regional patterns with clear visuals.",
        "link": "apps/covid-19/",
        "title": "Covid-19 Dashboard",
        "about": "An interactive dashboard built with Python and Plotly Dash to visualize global COVID-19 trends.",
        "tech": ["Tableau", "Excel", "Python", "HTML"],
        "features": ["Dynamic filters for country and time range", "Visualizations of confirmed cases, recoveries, and deaths", "Line and bar charts for comparative analysis"]
    },
    {
        "img": "static/img/ipl_dashboard.png",
        "description": "Dive into this dynamic Tableau dashboard analyzing IPL matches up to 2024 — featuring team stats, player performances, and season-wise trends.",
        "link": "apps/ipl_dashboard/",
        "title": "IPL Dashboard",
        "about": "An interactive cricket analytics dashboard analyzing historical IPL (Indian Premier League) data to uncover team and player insights.",
        "tech": ["Tableau", "Excel", "Python", "HTML/CSS"],
        "features": ["Tabs for season overview, team stats, and player performance", "Filter by team, year, or player", "Interactive charts for runs, wickets, strike rates, and more"]
    }     
]
